app/controllers/employees_controller.rb

	def create
		@employee = Employee.new(employee_params)
		if @employee.save
---
INSERT INTO "employees" ("first_name", "middle_name", "last_name", "personal_email", "city", "state", "country", "pincode", "address_line_1", "address_line_2", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

	def update
		@employee = Employee.find(params[:id])
		if @employee.update(employee_params)
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "employees" SET "first_name" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["first_name", "Niladrig"], ["updated_at", "2023-03-08 09:54:48.267322"], ["id", 1]]